TexasInstruments/motor-control-sdk/examples/current_sense/icss_sdfm_nine_channel_load_share_continuous_mode/am243x-evm/r5fss0-0_freertos/example.syscfg
pruicss1.$name                                                                      = "CONFIG_PRU_ICSS0";
pruicss1.coreClk                                                                    = 300000000;
pruicss1.iepClk                                                                     = 300000000;
pruicss_g_v0_pwm1.PRUICSS                                                           = pruicss1;
sdfm1.pru                                                                           = pruicss1;
pruicss1.AdditionalICSSSettings[0].$name                                            = "CONFIG_PRU_ICSS_IO0";
pruicss1.AdditionalICSSSettings[0].PruEcapIO.create(1);
pruicss1.AdditionalICSSSettings[0].PruEcapIO[0].$name                               = "CONFIG_PRU_ICSS_ECAP_IO0";
pruicss1.AdditionalICSSSettings[0].PruEcapIO[0].PRU_ICSSG0_ECAP.$assign             = "PRU_ICSSG0_ECAP0";
pruicss1.AdditionalICSSSettings[0].PruEcapIO[0].PRU_ICSSG0_ECAP.IN_APWM_OUT.$assign = "PRG0_PRU1_GPO15";
pruicss1.AdditionalICSSSettings[0].PruEcapIO[0].PRU_ICSSG0_ECAP.IN_APWM_OUT.$used   = true;
pruicss1.intcMapping.create(9);
pruicss1.intcMapping[0].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING0";
pruicss1.intcMapping[0].event                                                       = "21";
pruicss1.intcMapping[1].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING1";
pruicss1.intcMapping[1].event                                                       = "22";
pruicss1.intcMapping[2].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING2";
pruicss1.intcMapping[2].event                                                       = "23";
pruicss1.intcMapping[3].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING3";
pruicss1.intcMapping[3].event                                                       = "24";
pruicss1.intcMapping[3].channel                                                     = "5";
pruicss1.intcMapping[4].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING4";
pruicss1.intcMapping[4].event                                                       = "25";
pruicss1.intcMapping[4].channel                                                     = "5";
pruicss1.intcMapping[5].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING5";
pruicss1.intcMapping[5].event                                                       = "26";
pruicss1.intcMapping[5].channel                                                     = "5";
pruicss1.intcMapping[6].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING6";
pruicss1.intcMapping[6].event                                                       = "27";
pruicss1.intcMapping[6].channel                                                     = "8";
pruicss1.intcMapping[7].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING7";
pruicss1.intcMapping[7].event                                                       = "28";
pruicss1.intcMapping[7].channel                                                     = "8";
pruicss1.intcMapping[8].$name                                                       = "CONFIG_ICSS0_INTC_MAPPING8";
pruicss1.intcMapping[8].event                                                       = "29";
pruicss1.intcMapping[8].channel                                                     = "8";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
sdfm1.PRU_ICSSG0_PRU.GPI16.$suggestSolution                                      = "PRG0_PRU0_GPO16";
sdfm1.PRU_ICSSG0_PRU.GPI1.$suggestSolution                                       = "PRG0_PRU0_GPO1";
sdfm1.PRU_ICSSG0_PRU.GPI3.$suggestSolution                                       = "PRG0_PRU0_GPO3";
sdfm1.PRU_ICSSG0_PRU.GPI5.$suggestSolution                                       = "PRG0_PRU0_GPO5";
sdfm1.PRU_ICSSG0_PRU.GPI7.$suggestSolution                                       = "PRG0_PRU0_GPO7";
sdfm1.PRU_ICSSG0_PRU.GPI18.$suggestSolution                                      = "PRG0_PRU0_GPO18";
sdfm1.PRU_ICSSG0_PRU.GPI11.$suggestSolution                                      = "PRG0_PRU0_GPO11";
sdfm1.PRU_ICSSG0_PRU.GPI13.$suggestSolution                                      = "PRG0_PRU0_GPO13";
sdfm1.PRU_ICSSG0_PRU.GPI15.$suggestSolution                                      = "PRG0_PRU0_GPO15";
sdfm1.PRU_ICSSG0_PRU.GPI17.$suggestSolution                                      = "PRG0_PRU0_GPO17";
debug_log.uartLog.UART.RXD.$suggestSolution                                      = "UART0_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution                                      = "UART0_TXD";
pruicss_g_v0_pwm1.PRUICSS_PWM_CHANNEL[0].PRU_ICSSG0_PWM.$suggestSolution         = "PRU_ICSSG0_PWM0";
pruicss_g_v0_pwm1.PRUICSS_PWM_CHANNEL[0].PRU_ICSSG0_PWM.pwmPin.$suggestSolution  = "PRG0_PRU0_GPO12";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[0].PRU_ICSSG0_PWM.TZ_OUT.$suggestSolution = "PRG0_PRU0_GPO19";
pruicss_g_v0_pwm1.PRUICSS_PWM_TRIPZONE[2].PRU_ICSSG0_PWM.TZ_OUT.$suggestSolution = "PRG0_PRU1_GPO8";
